{
  "categories": [
    {
      "id": "",
      "titl": ""
    }
  ],
  "products": [
    {
      "id": 2,
      "title": "هندزفری بی سیم",
      "price": "100",
      "count": "10",
      "img": "/img/head.jpeg",
      "popularity": "1",
      "sale": "10",
      "colors": "00000",
      "productDesc": "هندزفری بلوتوثی لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\r\n",
      "url": "headset",
      "categoryID": 1
    },
    {
      "id": 3,
      "title": "تیشرت مشکی",
      "price": 290000,
      "count": 129,
      "img": "/img/tshirt.jpeg",
      "popularity": 82,
      "sale": 9100000,
      "colors": 1,
      "productDesc": "تیشرت مشکی لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\r\n",
      "url": "black-tshirt",
      "categoryID": 3
    },
    {
      "id": 6,
      "title": "روغن اویلا",
      "price": 78000,
      "count": 900,
      "img": "/img/oil.jpeg",
      "popularity": 76,
      "sale": 17000000,
      "colors": 1,
      "productDesc": "روغن اویلا لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\r\n",
      "url": "oila-oil",
      "categoryID": 3
    },
    {
      "id": 7,
      "title": "صابون گلنار",
      "price": 56000,
      "count": 313,
      "img": "/img/soap.jpeg",
      "popularity": 83,
      "sale": 19782000,
      "colors": 1,
      "productDesc": "صابون گلنار لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.\r\n",
      "url": "golnar-soap",
      "categoryID": 3
    }
  ],
  "users": [
    {
      "id": 1,
      "firstname": "رضا",
      "lastname": "احمدی",
      "username": "alireza_ahmdi19",
      "password": "19901432",
      "phone": 9129872314,
      "city": "تهران",
      "email": "alireza@gmail.com",
      "address": "تهران - خیابان فلان - کوچه فلان",
      "score": 98,
      "buy": 9000000
    },
    {
      "id": 2,
      "firstname": "حسین",
      "lastname": "محمدی",
      "username": "hosyn_mmdi",
      "password": "ho3ein_12",
      "phone": 9921558293,
      "city": "تبریز",
      "email": "ho3ein@gmail.com",
      "address": "تبریز - خیابان فلان - کوچه فلان",
      "score": 31,
      "buy": 12000000
    },
    {
      "id": 3,
      "firstname": "علی",
      "lastname": "حسینی",
      "username": "ali_9001",
      "password": "ali190012",
      "phone": 9943287617,
      "city": "شیراز",
      "email": "ali@gmail.com",
      "address": "شیراز - خیابان فلان - کوچه فلان",
      "score": 28,
      "buy": 8541000
    }
  ],
  "comments": [
    {
      "id": 3,
      "isAccept": 0,
      "body": "این محصول خیلی خوب بود. ممنون از سایت خوبتون",
      "date": "1401-07-01",
      "hour": "01:19",
      "userID": "علیرضا",
      "productID": "تیشرت مشکی"
    },
    {
      "id": 1,
      "isAccept": 0,
      "body": "سلام، من از این محصول رضایت کافی رو دارم",
      "date": "1401-07-12",
      "hour": "12:01",
      "userID": "حسین",
      "productID": "صابون گلنار"
    },
    {
      "id": 2,
      "isAccept": 0,
      "body": "سلام، متاسفانه کیفیت کافی رو نداشت",
      "date": "1401-06-19",
      "hour": "18:09",
      "userID": "علی",
      "productID": "هندزفری بلوتوثی"
    }
  ],
  "admins": [
    {
      "id": 1,
      "fistname": "",
      "lastname": "",
      "username": "",
      "password": "",
      "task": "",
      "token": "",
      "img": ""
    }
  ],
  "orders": [],
  "offs": []
}